> ./splay
> verbose
> insert 1
< Element inserted
> insert 2
< Element inserted
> insert 3
< Element inserted
> insert 4
< Element inserted
> insert 5
< Element inserted
> insert 6
< Element inserted
> print
< 1 2 3 4 5 6 
< 1 2 3 4 5 6 
< 1:0(,2:0(,3:0(,4:0(,5:0(,6:0)))))
> access 6
< Element accessed
> print
< 6 1 3 2 5 4 
< 1 2 3 4 5 6 
< 6:0(1:0(,3:0(2:0,5:0(4:0,))),)
